КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул2/КонтурЛогистика_ТрН_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительСтрока</name>
    <comment>kl-driver из customData</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтметкиПеревозчика</name>
    <comment>есть ли в титуле элемент ОтметПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЗамечанияПеревозчика</name>
    <comment>есть ли в титуле элемент ЗамПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфПрвПрием</name>
    <comment>Дата формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПрвПрием</name>
    <comment>Время формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфГО</name>
    <comment>Дата формирования файла обмена информации грузоотправителя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфГО</name>
    <comment>Время формирования файла обмена информации грузоотправителя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфГО</name>
    <comment>Идентификатор файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспрГО</name>
    <comment>Номер исправоления титула 1</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспрГО</name>
    <comment>Дата исправления титула 1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПГО</name>
    <comment>Электронная подпись файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПриб</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрУбыт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПосПрием</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамСостГруз</name>
    <comment>Оговорки и замечания в отношении фактического состояния груза, креплении груза, тары, упаковки, маркировки и опломбирования</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамМасс</name>
    <comment>Оговорки и замечания в отношении фактического состояния груза, креплении груза, тары, упаковки, маркировки и опломбирования¶Оговорки и замечания в отношении массы груза</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамКолМест</name>
    <comment>Оговорки и замечания в отношении количества грузовых мест</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамПогрРаб</name>
    <comment>Оговорки и замечания в отношении проведения погрузочных работ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОбОтказеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиПеревозчика</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтмАктВзв</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамечанияИнфПол</name>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул2/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "2");
	
КонецПроцедуры

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфГО");
	МассивКлючевых.Добавить("ВрИнфГО");
	
	МассивКлючевых.Добавить("ДатФайлИнфГО");
	МассивКлючевых.Добавить("ВрФайлИнфГО");
	МассивКлючевых.Добавить("ИдФайлИнфГО");
	МассивКлючевых.Добавить("НомИспрГО");
	МассивКлючевых.Добавить("ДатаИспрГО");
	МассивКлючевых.Добавить("ЭПГО");
	
	МассивКлючевых.Добавить("ВодительСтрока");
	МассивКлючевых.Добавить("ЗамечанияВодителя");
	
	Возврат МассивКлючевых;
	
КонецФункции

// Функция - Проверить документф
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.ДокументЭТРН, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	   	
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		Если Не ДокументОбъектИлиСсылка.ЕстьОтказВПодписи Тогда
			
			ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
			
			КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьТранспортноеСредствоВходящегоТитула1(
				ДокументОбъектИлиСсылка, ТаблицаОшибок);
			
		КонецЕсли;
		
		Если ДокументОбъектИлиСсылка.ЕстьЗамечанияПеревозчика Тогда
			
			ПроверитьЗамечания(ДокументОбъектИлиСсылка, ТаблицаОшибок);
			
		КонецЕсли;
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если Не ЗначениеЗаполнено(ДокументЭТРН) Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			Если Не ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(Объект.ДокументЭТРН.УИД) Тогда
			ТекстОшибки = "Еще не загружен УИД транспортной накладной. Попробуйте выполнить обмен и ввести титул заново.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
				"УИД_ТрН", КатегорияПредупреждение, ТекстОшибки, "Выполнить обмен");
		КонецЕсли;
		
		РеквизитыЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ДокументЭТРН, "ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку, ПогрузкуОсуществляет, Грузоотправитель");
		Если РеквизитыЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(РеквизитыЭТРН.ПогрузкуОсуществляет) Тогда
			ИстинныйГрузоотправитель = РеквизитыЭТРН.ПогрузкуОсуществляет;
		Иначе
			ИстинныйГрузоотправитель = РеквизитыЭТРН.Грузоотправитель;
		КонецЕсли;
		
		Если Не ИстинныйГрузоотправитель.Наш Тогда
			Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок,, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭПГО)  Тогда
		
		ТекстОшибки = "Не получена подпись грузоотправителя. Попробуйте выполнить обмен и перезаполнить титул";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ЭПГО", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
	КонецЕсли;
	
	Если Объект.ЕстьОтказВПодписи И Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
		
		ТекстОшибки = "Не указана причина отказа в подписи";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул3.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
КонецПроцедуры

Процедура ПроверитьИнфПол(Знач Объект, ТаблицаОшибок)
	
	МассивПроверок = Новый Массив;
	МассивПроверок.Добавить("ИнфПол");
	МассивПроверок.Добавить("ОтметкиИнфПол");
	МассивПроверок.Добавить("ЗамечанияИнфПол");
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьИнфПол(Объект, МассивПроверок, ТаблицаОшибок);	
	
КонецПроцедуры	

Процедура ПроверитьОтметки(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ИмяТЧ = "ОтметкиПеревозчика";
	
	Для Каждого Отметка Из Объект.ОтметкиПеревозчика Цикл 
		
		ТекущийНомерСтроки = Отметка.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(Отметка.ДатаИВремяОтметки) Тогда
			
			ТекстОшибки = "Укажите Дату отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДатаИВремяОтметки", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отметка.ОписаниеОбстоятельств) Тогда
			
			ТекстОшибки = "Укажите Описание обстоятельств отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОписаниеОбстоятельств", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать описание обстоятельств");
			
		КонецЕсли;
		
		НайденныеШтрафы = Объект.Штрафы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Штраф Из НайденныеШтрафы Цикл 
			
			Если Не ЗначениеЗаполнено(Штраф.ИтогРазмШтрРФ) Тогда 
				
				ТекстОшибки = "Укажите Размер штрафа для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Штрафы", Штраф.НомерСтроки, 
					"ИтогРазмШтрРФ", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать размер штрафа");
				
			КонецЕсли;	
			
		КонецЦикла;
		
		НайденныеАкты = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Акт Из НайденныеАкты Цикл 
						
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И Не ЗначениеЗаполнено(Акт.АктНаименование) 
				И Не ЗначениеЗаполнено(Акт.АктДата) 
				И Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
				И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей Акта для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
								
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И (ЗначениеЗаполнено(Акт.АктНаименование)
				Или ЗначениеЗаполнено(Акт.АктНомер) 
				Или ЗначениеЗаполнено(Акт.АктДата)
				Или ЗначениеЗаполнено(Акт.АктДопСведДок)
				Или ЗначениеЗаполнено(Акт.СтороныСоставители) 
				Или ЗначениеЗаполнено(Акт.ДополнительныйСоставитель)) Тогда	
					
				Если Не ЗначениеЗаполнено(Акт.АктНаименование) Тогда 
					
					ТекстОшибки = "Укажите Наименование акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.АктДата) Тогда 
					
					ТекстОшибки = "Укажите Дату акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктДата", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
					И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
					
					ТекстОшибки = "Укажите Стороны составители или Доп.составителя акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"СтороныСоставители", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители акта");
					
				КонецЕсли;
					
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПроверитьЗамечания(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
				
	Если Не ЗначениеЗаполнено(Объект.ЗамДатВрПриб) 
		И Не ЗначениеЗаполнено(Объект.ЗамДатВрПриб) 
		И Не ЗначениеЗаполнено(Объект.ЗамДатВрУбыт)
		И Не ЗначениеЗаполнено(Объект.ЗамДатВрПосПрием)
		И Не ЗначениеЗаполнено(Объект.ЗамСостГруз)
		И Не ЗначениеЗаполнено(Объект.ЗамМасс)
		И Не ЗначениеЗаполнено(Объект.ЗамКолМест)
		И Не ЗначениеЗаполнено(Объект.ЗамПогрРаб) Тогда
		
		ТекстОшибки = "Укажите хотя бы одно замечание перевозчика";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ЗамДатВрПриб", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;

КонецПроцедуры
		
Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул2.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли
